ЛИС2/src/Documents/лис_АктОтбораПроб/лис_АктОтбораПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_АктОтбораПроб</name>
  <registerRecords>AccumulationRegister.лис_ОтобранныеПробы</registerRecords>
  <registerRecords>InformationRegister.лис_ОтборПроб</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПлана</name>
    <type>
      <types>DocumentRef.лис_ПланОтбораПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораПроб</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
      <types>CatalogRef.Водозаборы</types>
      <types>CatalogRef.СелитебныеЗоны</types>
      <types>CatalogRef.Скважины</types>
      <types>CatalogRef.СанитарноЗащитныеЗоны</types>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельОтбораПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборудованиеДляОтбораПроб</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияУсловияПроведенияАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияТранспортировкиИХраненияПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВодыПриОтборе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаВМестеОтбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативныеДокументы</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНД</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования1</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПолучил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтобралПробу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствовалПриОтбореПроб</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробуПринял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатНаружнегоОсмотраПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИДатаДоставкиВЛабораторию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пробы</name>
    <attributes>
      <name>ТочкаОтбораПробы</name>
      <type>
        <types>CatalogRef.ТочкиКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпределяемыйПоказатель</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕмкостиДляОтбораПроб</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеПринадлежности</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПробы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КонсервантыДляАнализа</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеРеактивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ШифрПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/Enums/РазделыУчетаЭкоаналитическогоКонтроля/РазделыУчетаЭкоаналитическогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчетаЭкоаналитическогоКонтроля</name>
  <enumValues>
    <name>ПромышленныеВыбросы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныйВоздух</name>
  </enumValues>
  <enumValues>
    <name>СточныеВоды</name>
  </enumValues>
  <enumValues>
    <name>ПриродныеВоды</name>
  </enumValues>
  <enumValues>
    <name>Почвы</name>
  </enumValues>
  <enumValues>
    <name>ДонныеОтложения</name>
  </enumValues>
  <enumValues>
    <name>ФизическиеФакторы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныеОсадки</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Documents/лис_АктОтбораПроб/Forms/ФормаДокумента/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФорму()
	
	Если Не ЗначениеЗаполнено(Объект.РазделУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.АтмосферныйВоздух")  Тогда
		МассивТиповАтмосфера = Новый Массив;
		МассивТиповАтмосфера.Добавить(Тип("СправочникСсылка.СанитарноЗащитныеЗоны"));
		МассивТиповАтмосфера.Добавить(Тип("СправочникСсылка.СелитебныеЗоны"));
		
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповАтмосфера);
		Элементы.МестоОтбораПроб.ВыбиратьТип 	 = Истина;
		
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПроизводственныеПлощадки");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЗВАтмосфера");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	 = Ложь;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
		Элементы.МестоОтбораПроб.Видимость = Истина; 
		
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ПромышленныеВыбросы")  Тогда
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИсточникиЗагрязнения");
		Элементы.МестоОтбораПроб.ВыбиратьТип 	   = Ложь;
		
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЗВАтмосфера");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Ложь;
		
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.СточныеВоды")  Тогда
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВыпускиВВоду");
		Элементы.МестоОтбораПроб.ВыбиратьТип 	   = Ложь;
		
		МассивТиповЗВПриродныеВоды = Новый Массив;
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.ЗВВода"));
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.КонтролируемыеПоказателиВВоде"));
	
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповЗВПриродныеВоды);
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Истина;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;		
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ПриродныеВоды")  Тогда
		МассивТиповПриродныеВоды = Новый Массив;
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.Скважины"));
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.ВыпускиВВоду"));
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.ВодныеОбъекты"));
		МассивТиповПриродныеВоды.Добавить(Тип("СправочникСсылка.Водозаборы"));
		
		Элементы.МестоОтбораПроб.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповПриродныеВоды);
		Элементы.МестоОтбораПроб.ВыбиратьТип 	   = Истина;
		
		МассивТиповЗВПриродныеВоды = Новый Массив;
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.ЗВВода"));
		МассивТиповЗВПриродныеВоды.Добавить(Тип("СправочникСсылка.КонтролируемыеПоказателиВВоде"));
	
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповЗВПриродныеВоды);
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Истина;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.Почвы")  Тогда
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КонтролируемыеПараметрыВПочвеДонныхОтложениях");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПроизводственныеПлощадки");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ДонныеОтложения")  Тогда
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВодныеОбъекты");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КонтролируемыеПараметрыВПочвеДонныхОтложениях");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.МестоОтбораПроб.Видимость = Ложь;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ФизическиеФакторы")  Тогда
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ФакторыФизическогоВоздействия");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.ОбъектОтбираемойПробы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПроизводственныеПлощадки");
		Элементы.ОбъектОтбираемойПробы.ВыбиратьТип 	   = Ложь;
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ОбъектОтбораПроб", "Объект.ОбъектОтбораПроб");
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПробыТочкаОтбораПробы.СвязиПараметровВыбора = НовыеСвязи;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	ИначеЕсли Объект.РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.АтмосферныеОсадки")  Тогда
		Элементы.ПробыОпределяемыйПоказатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВеществаИПараметрыВАтмосферныхОсадках");
		Элементы.ПробыОпределяемыйПоказатель.ВыбиратьТип 	  = Ложь;
		
		Элементы.МестоОтбораПроб.Видимость = Истина;
		Элементы.ПробыТочкаОтбораПробы.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПослеЗакрытияПодбораПроб(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда	
		
		ПланОтбораПроб = Результат.ПланОтбораПроб;
		ИндексПробы = Результат.ИндексПробы;
		
		Объект.Организация = ПланОтбораПроб.Лаборатория.Владелец;
		Объект.Лаборатория = ПланОтбораПроб.Лаборатория;
		Объект.ДокументПлана = ПланОтбораПроб;
		Объект.ДатаОтбора = ПланОтбораПроб.ПериодС;
		Объект.ОбъектКонтроля = ПланОтбораПроб.Основное[ИндексПробы].ТочкаКонтроля.ОбъектКонтроля;
		Объект.Заказчик = ПланОтбораПроб.Основное[ИндексПробы].Организация;
		Объект.КоличествоПроб = ПланОтбораПроб.Основное[ИндексПробы].КоличествоЗамеров;
		Объект.ОбъектОтбораПроб = ПланОтбораПроб.Основное[ИндексПробы].ОбъектЗагрязнения;
		Объект.ЗаданиеВыдал = ПланОтбораПроб.ОтветственныйСотрудник;
		Объект.ЗаданиеПолучил = ПланОтбораПроб.Основное[ИндексПробы].СотрудникПроводящийЗамер;
		Объект.ОтобралПробу = ПланОтбораПроб.Основное[ИндексПробы].СотрудникПроводящийЗамер;
		Объект.РазделУчета = ПланОтбораПроб.ВидГрафика;
		
		Отбор = новый Структура;
		Отбор.Вставить("КлючСтроки", ПланОтбораПроб.Основное[ИндексПробы].КлючСтроки);
		НайденныеСтроки = ПланОтбораПроб.ЗагрязняющиеВещества.НайтиСтроки(Отбор);
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			НС = Объект.Пробы.Добавить();
			НС.ТочкаОтбораПробы = ПланОтбораПроб.Основное[ИндексПробы].ТочкаКонтроля;
			НС.ОпределяемыйПоказатель = НайденнаяСтрока.ЗагрязняющееВещество;
		КонецЦикла;
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НС = Объект.Пробы.Добавить();
			НС.ТочкаОтбораПробы = ПланОтбораПроб.Основное[ИндексПробы].ТочкаКонтроля;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделУчетаПриИзменении(Элемент)
	
	Объект.ОбъектКонтроля = Неопределено;
	
	Объект.ОбъектОтбораПроб = Неопределено;
	
	Объект.Пробы.Очистить();
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПланаОтбораПроб(Команда)

	ПараметрыПодбораПроб = новый Структура;
	ПараметрыПодбораПроб.Вставить("ПланОтбораПроб", Объект.ДокументПлана);
	
	ВыполнитьПослеЗакрытияПодбораПроб = новый ОписаниеОповещения("ВыполнитьПослеЗакрытияПодбораПроб", ЭтотОбъект);
	
	ОткрытьФорму("Документ.лис_АктОтбораПроб.Форма.ФормаПодбораПроб", ПараметрыПодбораПроб, ЭтаФорма, , ВариантОткрытияОкна.ОтдельноеОкно, , ВыполнитьПослеЗакрытияПодбораПроб, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти
